{"link": "https://www.wired.com/gallery/best-bluetooth-speakers/", "title": "15 Best Bluetooth Speakers (2020) Ultimate Ears, JBL, Sonos", "text": "Portable Bluetooth speakers still rock, but thanks in large part to the smart speaker revolution, they aren't the hottest products around.\n\nIt's fun and easy to ask an Amazon Echo or Google Home to play your favorite track or tell you the weather, but smart speakers have a few crutches, first and foremost being stable Wi-Fi. They also often aren't portable or waterproofed for the great outdoors. In (mostly) forgoing smarts, Bluetooth speakers are nearly always more versatile, more rugged, and more portable—and they'll work with anybody's smartphone. They also sound as good or better than many of their smart-speaker equivalents.\n\nIn the past year, we've tested more than 35 different Bluetooth speakers and researched dozens more online, and we can happily say they are still some of the best small devices you can listen to. Here are our favorites right now.\n\nBe sure to check out all our buying guides, including the Best Soundbars and Best Smart Speakers guides.\n\nUpdated for February 2020: We've updated links and pricing, gave a bigger honorable mention to the Oontz Angle 3, and have removed the Riva Concert.", "publish_date": "None", "keywords": ["wifi", "weve", "jbl", "bluetooth", "ears", "smart", "portable", "best", "ultimate", "speakers", "2020", "weather", "arent", "sonos", "work", "15"], "authors": ["Jeffrey Van Camp", "Jeffrey Van Cam", "Parker Hal"], "summary": "Portable Bluetooth speakers still rock, but thanks in large part to the smart speaker revolution, they aren't the hottest products around.\nThey also often aren't portable or waterproofed for the great outdoors.\nIn (mostly) forgoing smarts, Bluetooth speakers are nearly always more versatile, more rugged, and more portable—and they'll work with anybody's smartphone.\nIn the past year, we've tested more than 35 different Bluetooth speakers and researched dozens more online, and we can happily say they are still some of the best small devices you can listen to.\nBe sure to check out all our buying guides, including the Best Soundbars and Best Smart Speakers guides."}