{"link": "https://www.tomsguide.com/us/best-bluetooth-speakers,review-1982.html", "title": "Best Bluetooth speakers 2020 Top portable wireless speakers", "text": "The best Bluetooth speakers make it easy to enjoy the coming summer months, even if you're simply spending most of your outdoor time in the backyard or on the patio. These wireless speakers pack rich sound into highly portable designs, often complete with rich feature sets for jamming out while outdoors.\n\nAnd even if you enjoy most of your music inside, the best Bluetooth speakers make a great addition to any audio setup. They offer a huge upgrade from your phone's tinny built-in speakers, and range in price from premium high-end models to great speakers that cost less than $50.\n\nThe best soundbars for your home theater setup\n\nHere are the best outdoor speakers you can buy\n\nThe best computer speakers\n\nBluetooth speakers come in a variety of shapes and sizes, from pocket-friendly portable models to massive speakers for your backyard or patio. Many of the top Bluetooth speakers support Alexa and Google Assistant, allowing you to control music playback, check the weather or start a call using intuitive voice commands. Better yet, lots of Bluetooth speakers are water- and dust resistant, meaning you can jam out by the pool without having to worry about damaging your device.\n\nSee all of our best Bluetooth speaker picks below.\n\nWhat is the best Bluetooth speaker?\n\nWe think the best Bluetooth speaker of all the models we’ve tested is the UE Megaboom 3. It lands in the sweet spot of offering nearly everything you’d want out of a Bluetooth speaker at a reasonable price point. The Megaboom 3 sounds great when playing all genres of music, offers an impressive 20 hours of playback and is sturdy enough to face the elements outdoors. It’ll even survive an accidental drop in the pool.\n\nThe best Bluetooth speaker for those on a budget is the Anker SoundCore 2. For $40, the SoundCore 2 delivers loud sound in a durable, compact body. While it’s a bit small for the average backyard party, it’s great to toss in your bag for a beach venture or other outing. Plus its 24 battery life will survive any day trip you have in mind.\n\nIf money is no object, the massive, $399 Sonos Move has the most features of any Bluetooth speaker we’ve tested. Its booming sound and clever carrying grip make it the ultimate home audio companion, while its Google Assistant and Alexa capabilities let you control your smart home devices. The Move's Auto TruePlay adjusts the speaker’s output settings to make it sound the best for the space it’s in, whether that’s your patio, deck, backyard or bedroom.\n\nFor a less expensive option of a Bluetooth speaker with smarts, the JBL Link 20 is a reliable choice. The Link 20 sounds as premium as the best Bluetooth speaker and provides a reasonable 10 hours of battery life. It’s waterproof, too, meaning you can bring Google Assistant in the pool with you next time you go for a dip.\n\nRead on for all of our best Bluetooth speaker picks.\n\nThe best Bluetooth speakers right now\n\n(Image credit: UE)\n\n1. UE Megaboom 3\n\nThe best Bluetooth speaker overall\n\nSize and Weight: 8.9 x 3.4-inches, 2 pounds | Battery Life (Rated): 20 hours | Water Resistance: Yes | Maximum Sound Level: 90db | Voice Controls: No\n\nBig bass and full vocals\n\nGood battery life\n\nCan pair with older Megaboom and Boom models for stereo sound\n\nBig and heavy for a portable\n\nNo speakerphone\n\nThanks to its excellent sound quality, long battery life and travel-ready ruggedness, the UE Megaboom 3 is the best Bluetooth speaker you can buy right now. This big, bold portable speaker pumps out rich 360-degree sound complete with crisp highs and satisfying low-end, and maxes out at 100 decibels of noise. And with an IPX7-rated design, it can survive drops, splashes and a fall into the pool without skipping a beat.\n\nThe Megaboom 3 is a bit on the bigger side compared to other portable speakers, and unlike many of its competitors, it doesn't have Alexa or Google Assistant support or other smart features. But if that’s not a dealbreaker, the Megaboom 3's sound quality and ruggedness can't be beat for the price. You can also pair it with older Megaboom and Boom models for stereo sound experience.\n\nRead our full UE Megaboom 3 review.\n\n(Image credit: Anker)\n\n2. Anker Soundcore 2\n\nThe best Bluetooth speaker value\n\nSize and Weight: 6.5 x 2.1 x 1.77 inches, 12.6 ounces | Battery Life (Rated): 24 hours | Water Resistance: Yes | Voice Controls: No\n\nGreat battery life\n\nWaterproof\n\nNot ideal for larger rooms\n\nThe Anker Soundcore 2 is the best Bluetooth speaker for folks shopping on a budget. For just $40, this tiny powerhouse delivers loud, well-balanced sound within an IPX5-rated design that can survive splashes, dust and snow. The speaker lasts a whopping 24 hours, thanks to Anker's best-in-class battery technology (the brand is also known for its reliable chargers), and the Soundcore 2's dual neodymium drivers ensure you'll get powerful sound in any setting.\n\nThe Soundcore's compact, 6.5 x 2.1 x 1.77-inch design makes this speaker perfect for tossing into your bag for a quick road trip, and it comes in vibrant blue and red color schemes in addition to the standard slick black. It’s low cost makes it ideal for environments where you wouldn’t mind it getting a little roughed up, too.\n\nCheck out the Anker Soundcore 2 on our list of the best cheap Bluetooth speakers.\n\n\n\n(Image credit: Ultimate Ears)\n\n3. UE Wonderboom 2\n\nHuge sound in a tiny package\n\nSize and Weight: 4 inches x 3.7 inches, 0.9 pounds | Battery Life (Rated): 13 hours | Water Resistance: Yes | Voice Controls: No\n\nFull bass for a small speaker\n\nWaterproof and dustproof\n\nNo app\n\nNo visual battery life indicator\n\nThe UE Wonderboom 2 is proof that great things can come in small packages. This tiny $100 speaker delivers huge sound within a small 4-inch cylinder, complete with throbbing bass, balanced midtones and crisp vocals. It can survive being dunked in 3 feet of water for up to 30 minutes and is dust resistant, making it perfect for your next trip to the pool, beach or park.\n\nOther key features include an impressive 13-hour battery life and the ability to pair two Wonderbooms together for immersive stereo sound. If you need an especially small speaker that’s a breeze to tote around and don't want to spend more than $100, the Wonderboom 2 is hard to beat. Add a carabiner to the clever loop to attach the Wonderboom to your bag as you head out the door.\n\nRead our full UE Wonderboom 2 review.\n\n(Image credit: Tom's Guide)\n\n4. Sonos Move\n\nSonos sound meets high-end smarts\n\nSize and Weight: 9.4 x 6.3 x 5 inches, 6.6 pounds | Battery Life (Rated): 10 hours | Water Resistance: Yes (IP56 rated for splashes) | Voice Controls: Yes (Alexa and Google Assistant)\n\nSuperb audio quality\n\nBuilt-in Automatic TruePlay technology\n\nEasy Wi-Fi-to-Bluetooth connection conversion\n\nPricey\n\nNo smart features in Bluetooth mode\n\nAt long last, Sonos has delivered a wireless Bluetooth speaker — and it's pretty great. The Sonos Move takes the great sound and rich feature set found in the Sonos One and lets you take it on the go, with a 10-hour battery packed into a portable (albeit fairly chunky) design.\n\nWe found the Move delivers a booming, crisp sound complete with satisfying bass and clear vocals. The speaker works with all major streaming services including Spotify and Apple Music and sports Apple AirPlay 2 support, and can seamlessly switch from Bluetooth to Wi-Fi on the fly. Alexa and Google Assistant support allow you to do anything from check the weather to control your smart home, and the Move's Auto TruePlay automatically tunes the speaker's audio output for wherever you're listening, whether you're having a rooftop party or rocking out in your bedroom\n\nRead our full Sonos Move review.\n\n5. V-Moda Remix\n\nA Bluetooth speaker for the luxury crowd\n\nSize and Weight: 8.1 x 2.5 x 2.5 inches, 1.9 pounds | Battery Life (Rated): 10 hours | Water Resistance: No | Voice Controls: No\n\nLoud, balanced audio with booming bass\n\nStunning design\n\nLots of customization options\n\nDaisy-chain multiple speakers\n\nA bit expensive\n\nNo multiroom solution\n\nFor a premium speaker that looks as good as it sounds, look no further than the V-Moda Remix. This drool-worthy showpiece is the best Bluetooth speaker for the design-oriented, and can be customized to your heart's content. The base, $300 model looks slick in aluminum or vegan leather. Meanwhile, people with bottomless budgets and a penchant for style can opt for steel or platinum finishes (the later of which will run you well over $300,000).\n\nMost importantly, the Remix sounds great, offering plenty of bass as well as a built-in headphone amp for enhancing the audio of your favorite set of cans. The Remix's 10-hour battery life certainly makes this speaker worthy of longer jam sessions, and its trusty microphone allows for crisp call quality whether you’re set up inside your house or out.\n\nRead our full V-Moda Remix review.\n\n(Image credit: Tom's Guide)\n\n6. Amazon Echo (3rd Gen)\n\nThe perfect speaker for a smart home\n\nSize and Weight: 4.8 x 3.9-inches, 27 ounces | Battery Life (Rated): N/A | Water Resistance: No | Voice Controls: Yes (Alexa)\n\nAffordable cost\n\nTerrific sound quality\n\nSeamless Alexa integration\n\nGreat new design\n\nToo similar to Echo Plus\n\nIf you're looking for a good-sounding Bluetooth speaker that doubles as a virtual assistant, the third-generation Amazon Echo costs $99 and is among the best Alexa speakers you can buy. The Echo sports an attractive fabric-covered design that fits into most modern home decor. But the real calling card here is Alexa, Amazon's digital assistant that can check the weather for you, read your emails and control any of the best smart home devices all with just a quick voice command.\n\nThe newest Echo isn't too shabby for music, either, delivering the solid bass and strong overall volume found in the premium Echo Plus . Considering how many services and devices Alexa can interact with, this is the speaker to get if smart gadgets litter your home, and you don’t mind your Bluetooth speaker needing a wire.\n\nRead our full Amazon Echo (3nd gen) review.\n\n7. JBL Link 20\n\nGreat sound meets Google Assistant\n\nSize and Weight: 8.3 x 3.7 inches, 33.5 ounces | Battery Life (Rated): 10 hours | Water Resistance: Yes | Voice Controls: Yes (Google Assistant)\n\nPowered by Google Assistant\n\nPortable and rugged\n\nWell-balanced overall sound\n\nCan't make calls\n\nSmart Bluetooth speakers are becoming a dime a dozen, but the JBL Link 20 manages to stand out from the pack by being one of the few to prioritize Google Assistant. That means you can enjoy all of Google Home's smart features, such as being able to get dinner suggestions, traffic info and control any of the best Google Home compatible devices . The best part? You don't have to be tethered to your living room. The Link 20’s smart features work as far as your Wi-Fi will reach.\n\nThe Link 20 is also simply a great premium speaker, with balanced audio and 10 hours of battery life. Add in a rugged, IPX7-rated design built to endure a dunk in the pool or drop on the deck, and you've got one of the top speakers out there in the $200 range.\n\nRead our full JBL Link 20 review.\n\n(Image credit: JBL)\n\n8. JBL Clip 2\n\nA truly portable speaker\n\nSize and Weight: 5.5 x 3.7 x 1.7 inches, 6.5 ounces | Battery Life (Rated): 8 hours | Water Resistance: Yes | Voice Controls: No\n\nVery good sound for a small speaker\n\nImproved battery life\n\nWaterproof\n\nNot very loud\n\nNo app\n\nThe JBL Clip 2 is about as portable as a Bluetooth speaker can get, rocking a tiny, circular design that you can clip to your shorts or backpack as you hit the road or trail in style. The puck-size Clip 2 comes in a myriad of colorful designs, all of which can withstand plenty of splashes and spills, thanks to the speaker's IPX7 rating.\n\nThe Clip 2 offers great sound quality given its size and price, delivering solid treble and satisfying bass for your expeditions. It'll last 8 hours on the road, and it packs a dependable speakerphone for making calls. If you own the original Clip, which wasn’t waterproof, you may want to upgrade if you find yourself using it outside frequently. And if you’re not bringing it wherever you are, you should be.\n\nRead our full JBL Clip 2 review.\n\nHow to choose the best Bluetooth speaker for you\n\nThere are a couple things you’ll want to consider when shopping for a Bluetooth speaker, the first of which is whether you want it to be wireless or wired. While a number of wired speakers like the Amazon Echo provide excellent Bluetooth listening, you can’t bring them outside your kitchen or living room. Stick to a speaker with a rechargeable battery for on-the-go audio.\n\nWith that, you’ll need to decide if an option with a voice assistant is the best Bluetooth speaker for you. If you plan to use your speaker in your backyard, it could be useful to have Google Assistant’s or Alexa’s powers at your disposal. That way you can change the music using your voice, rather than controlling the audio through your phone. These smart features will not work beyond your home’s Wi-Fi, so opt for a non-smart Bluetooth speaker for the beach or other outdoorsy locales.\n\nHow we test the best Bluetooth speakers\n\nEvery product on this list is considered the best Bluetooth speaker for one or more standout features, however each must meet basic requirements during our testing to be considered. We spend several hours listening to music, making calls and toting around every speaker to make sure it sounds great across all genres, provides solid call quality and withstands minor bumps or splashes.\n\nIf a speaker offers smart features, we enable the supported voice assistant to see how it fares against other top rated smart speakers. We’ll use it to control smart home devices, browse playlists and get answers to other common queries.\n\nWe also test battery life, exhausting each speaker’s battery after a full charge to see how long it can last under realistic conditions. A smart speaker connected to Wi-Fi should last at least 10 hours, while a standard Bluetooth speaker should last around 20. Most people want to know how much play time they can expect when their speaker is brought along for a day trip.", "publish_date": "2020-06-11", "keywords": ["x", "bluetooth", "speaker", "life", "sound", "smart", "best", "speakers", "2020", "hours", "wireless", "battery", "portable"], "authors": ["Michael Andronico"], "summary": "And even if you enjoy most of your music inside, the best Bluetooth speakers make a great addition to any audio setup.\nWe think the best Bluetooth speaker of all the models we’ve tested is the UE Megaboom 3.\nHow to choose the best Bluetooth speaker for youThere are a couple things you’ll want to consider when shopping for a Bluetooth speaker, the first of which is whether you want it to be wireless or wired.\nWith that, you’ll need to decide if an option with a voice assistant is the best Bluetooth speaker for you.\nHow we test the best Bluetooth speakersEvery product on this list is considered the best Bluetooth speaker for one or more standout features, however each must meet basic requirements during our testing to be considered."}