{"link": "https://www.techhive.com/article/3123762/best-bluetooth-speakers.html", "title": "Best Bluetooth speakers Reviews and buying advice", "text": "There was a time when Bluetooth speakers were like jelly beans: They were cheap, they all looked the same, and they were invariably of dubious quality. Times have changed. Every major audio manufacturer has at least one model on the market today, and most have several. If you haven’t listened to a Bluetooth speaker lately, you’re in for a very pleasant surprise.\n\nThe industry’s progress doesn’t mean that every Bluetooth speaker justifies its price tag, no matter how inexpensive it might be. There’s still plenty of dreck floating around. Don’t worry, we’re here to help you steer clear of the junk and point you to the best speakers at the price range that fits your budget.\n\nTo that end, we’ve picked the best Bluetooth speakers (and runners-up in some cases) in six categories: budget, mid-range (up to $300), outdoor, bookshelf, high-end (up to $750), and—yes, there are ultra-high-end Bluetooth speakers—price is no object. Some of our picks can be used indoors and out, but we’ve also named our favorites that are designed primarily as outdoor speakers.\n\nUpdated June 25, 2020 to add our Anker Soundcore Rave Neo review. This largeish speaker targets one audience--dance partiers--and delivers what those folks are looking for: Deep bass at high volume, accompanied by a color LED light show. But don't let its looks fool you: It sounds a lot better than you might expect.\n\nBest budget Bluetooth speaker\n\nThe Bluetooth speaker market is a cutthroat business when you get to this price range. The good news for music lovers is that you can find some very good products here. If $60 is too much for your budget, consider our runner-up, the Aukey SK-S1 (see below). Otherwise, we can’t say enough good things about the Tronsmart Element Force SoundPulse, which features IPX7 weatherization, support for True Wireless Stereo (so you can operate two of them as a stereo pair), and absolutely fantastic sound (in Extra Bass EQ mode, that is). That’s a lot of speaker for just 60 bucks.\n\nRunner-up\n\nAukey SK-S1 Bluetooth speaker Read TechHive's review MSRP $39.99 See it This Bluetooth speaker is meant to look good on your desktop, not the pool. It also sounds quite nice at low volumes. Given the price, and speaker phone functionality, it's pretty much the perfect workplace audio accoutrement.\n\nThe Aukey SK-S1 doesn’t have all the features—or audio power—of our top pick in this category, but it is an attractively designed near-field speaker that’s fabricated mostly from metal, where you might expect to find ABS plastic. And it sounds very good—at least until you push it to the edge. It’s not the right choice to fill a room, and it’s not at all protected from the weather, but it is a great deal for the money,\n\nBest mid-priced Bluetooth speaker\n\nFluance Ai60 Read TechHive's review See it The Fluance Ai60 offers spectacular sound quality with amazingly deep bass for far less than I would have expected. They're large, but definitely in charge!\n\nThese Bluetooth bookshelf speakers blew us away with their impeccable performance for the price, comparing favorably with a competing pair that cost nearly four times as much. We were particularly impressed with their frequency range and their ability to dig deep into the low-frequency realm, all the way down to 35Hz. Highly recommended if you're looking for high-fidelity audio on a budget.\n\nBest high-end Bluetooth speaker\n\nIn addition to Bluetooth, you can control this speaker over Wi-Fi with Bluesound’s apps for Android, iOS, macOS, and Windows; it can be part of a multi-room audio system with other Bluesound speakers or other speakers that support Apple’s AirPlay 2 technology; you can configure two of them as a stereo pair; it supports the aptX HD codec for streaming high-resolution audio; and it features a bi-directional Bluetooth radio, so you can stream music to it and listen to music from it using Bluetooth headphones. It goes without saying this speaker sounds absolutely divine. Highly recommended.\n\nBest outdoor Bluetooth speaker\n\nThis is the best powered outdoor speaker we’ve heard since Soundcast introduced its Outcast speaker nearly 10 years ago. It’s built like a tank; splash resistant, so you can use it poolside or at the beach; and it delivers outstanding battery life. Most importantly, however, it sounds fantastic. Expensive, but worth it.\n\nRunner-up\n\nThe Soundcast VG7 won’t fit everyone’s budget, and while the Sonos Move isn’t exactly inexpensive, it’s engineered to withstand the elements, it sounds fantastic, and it’s supremely flexible, being able to stream music via either Bluetooth or Wi-Fi. Highly recommended.\n\nBest price-is-no-limit Bluetooth speaker\n\nThe Naim Mu-so 2nd Generation is, of course, much more than a Bluetooth speaker.It has a dual-band Wi-Fi adapter onboard, so you can use it in a multi-room audio system with other Naim components, any speaker that supports Apple’s AirPlay 2 technology, or anything that’s Chromecast compatible. It can play music on any connected USB storage device, and it can connect to any UPnP server on your network. It’s Roon Ready, too. Finally, it supports Spotify Connect and you can stream music from Tidal without leaving the Naim app. Oh, and it’s capable of decoding high-resolution music encoded at up to 32-bit resolution and at sampling rates as high as 384kHz. All that and it sounds amazing.\n\nRunner-up\n\nThe soundbar-like design of Naim’s Mu-so Bluetooth speaker isn’t for everyone. If you want elegantly designed high-end speakers you can connect to via Bluetooth (and lots of wired ways, too), Shinola (and its design partner, studio-monitor builder Barefoot Sound) have what you’re looking for. Named simply Shinola Bookshelf Speakers, these loudspeakers sound every bit as beautiful as they look.\n\nFeatures to look for in a Bluetooth speaker\n\nNot convinced the picks we’ve listed above are exactly right for you? This guide will help you sort through the facts, figures, and specs to determine which speaker will best meet your needs. Your first decision will be to choose between mobile and stationary form factors. The majority of Bluetooth speakers are portable because they get paired with mobile phones, but more and more manufacturers are introducing models designed to remain inside the home.\n\nChoosing a portable model gives you the best of both worlds in some respects, but a stationary speaker is more apt to blend into your home’s decor. And while we’ve heard some pretty spectacular portable Bluetooth speakers, a plug-in model is more likely to produce the sound you’re looking for if fidelity is priority one in your book.\n\nHere are the features you’ll want to evaluate in a Bluetooth speaker:\n\nTheo Nicolakis\n\nApp support: Companion apps can provide lots of additional features to a speaker that wouldn’t be possible with just physical buttons on the speaker itself. The app might enable more than one person to be the DJ, queuing up songs to play on the speaker. An app might enable you to create customized EQ curves for different styles of music, create wake-up alarms, or power the speaker on and off remotely.\n\naptX support: Bluetooth audio must be squeezed down in order to stream over the airwaves, and the default codec use lossy compression that throws some of the musical data away. Qualcomm’s aptX codec is lossless, so none of the musical detail is lost in the process. But aptX must be present at both ends of the stream, in the playback device and in the speaker. Most Android devices support aptX, but Apple devices do not.\n\naptX HD support: This version of Qualcomm’s codec supports high-resolution audio files, but it’s hard to find even in the highest-end Bluetooth speakers right now. As with its sibling, the codec must be supported on both the audio source and the speaker in order to work.\n\nBattery: Next to fidelity, a portable speaker’s most important feature is how long it can operate when it’s not plugged into the wall. You should expect a battery to last 10 to 20 hours, but remember that the bigger the battery, the heavier the speaker will be.\n\nMichael Brown\n\nCharging options: If your speaker has a battery, it will need to be charged. Speakers that charge their batteries via a USB port are more convenient than models that require an AC adapter, but larger batteries might not offer that option. Some speakers also let you plug in a USB cable to tap their battery to charge your smartphone.\n\nDSP: An onboard digital signal processor (DSP) lets you electronically change how the speaker is driven in order to compensate for speaker placement or the acoustical properties of your room, among other things.\n\nMounting options and accessories: A portable speaker should be easy to take with you. While some Bluetooth speakers count on their size to make them easy to grip, others provide a lanyard, carabiner clip, or a shoulder strap. It’s even more handy when the manufacturer provides standardized sockets and accessories for mounting the speaker to an object, such as your bike’s handlebars.\n\nAltec Lansing\n\nSome portable Bluetooth speakers are small enough that you can grip them in your hand, but it provide thread mounts so you can attach them\n\nSpeakerphone: Some Bluetooth speakers have built-in microphones that enable you to use the speaker as a speakerphone in concert with your smartphone. The sound quality will be much better than what you’ll get from your phone, and you’ll be able to turn the volume up much higher. This can be very handy for conference calls.\n\nStereo pairing: Some speakers let you create a left/right stereo pair with two speakers (this works best, of course, when the two speakers are identical).\n\nWeatherization: Portable Bluetooth speakers can be used indoors and out, so the best models provide some protection from the elements. Ideally, the manufacturer will let you know just how much protection you can expect by providing an IP (International Protection) marking. The first digit rates the enclosure’s protection from particulate matter (e.g., dust) and the second digit rates its protection against liquids.\n\nAn IP64 code, for instance, indicates that the speaker is completely protected from dust (6) and from water splashed onto it (4). The higher the numbers, the more protection you can expert If either digit is replaced by an X—IPX4, for example—the code indicates that the speaker isn’t rated for protection from particles (this doesn’t necessarily mean that it’s not protected from things like dust, just that the manufacturer doesn’t rate its protection).\n\nWi-Fi: Higher-priced Bluetooth speakers also provide the option of connecting to your Wi-Fi network, so that you can stream music from a NAS box. Wi-Fi streams will offer higher fidelity than Bluetooth, even if the speaker supports the aptX codec. A speaker that provides for a hardwired network connection is all the more versatile.\n\nWireless range: A Bluetooth speaker’s range depends on the power class of its radio, and it can vary widely and is impacted by the environment that it’s operating in. A Class 1 radio offers range of approximately 100 meters, but the number of walls between the Bluetooth source and the speaker and the type of materials in those walls will have a significant impact on range. It’s much easier for radio waves to pass through drywall than masonry, for instance. Objects in the signal path, such as large metal appliances, will reduce that range even further.\n\nOur latest Bluetooth speaker reviews", "publish_date": "None", "keywords": ["bluetooth", "music", "speaker", "range", "best", "reviews", "advice", "buying", "audio", "protection", "speakers", "sounds", "portable"], "authors": [], "summary": "To that end, we’ve picked the best Bluetooth speakers (and runners-up in some cases) in six categories: budget, mid-range (up to $300), outdoor, bookshelf, high-end (up to $750), and—yes, there are ultra-high-end Bluetooth speakers—price is no object.\nBest budget Bluetooth speakerThe Bluetooth speaker market is a cutthroat business when you get to this price range.\nRunner-upAukey SK-S1 Bluetooth speaker Read TechHive's review MSRP $39.99 See it This Bluetooth speaker is meant to look good on your desktop, not the pool.\nWeatherization: Portable Bluetooth speakers can be used indoors and out, so the best models provide some protection from the elements.\nWireless range: A Bluetooth speaker’s range depends on the power class of its radio, and it can vary widely and is impacted by the environment that it’s operating in."}