{"link": "https://www.whathifi.com/us/best-buys/best-bluetooth-speakers-portable-speakers-for-every-budget", "title": "Best Bluetooth speakers 2020 portable speakers for every budget", "text": "Best Bluetooth speakers Buying Guide: Welcome to What Hi-Fi?'s round-up of the best portable speakers you can buy in 2020.\n\nFinding the right Bluetooth speaker for you can be a tricksy task. It's nothing to do with shortage of options; every online and physical manufacturer from Apple to Ultimate Ears is vying for a bite of the Bluetooth cherry and, by association, your hard-earned cash. So, which model is most worthy of your precious coin? Fret not, we've rounded-up our pick of the best portable Bluetooth speakers across all shapes, sizes and prices to ensure you discover a product you'll be over the moon with.\n\nThe key thing here is to avoid opting for the first Bluetooth speaker that takes your fancy. Yes, it might be a looker, but it's really worth considering what you actually want from it. And since the two of you will likely be together for quite some time, why not read our independent review of the product – and maybe a few reviews of competing products in the price category – first? You might discover a few features you didn't know you could get for the money.\n\nWill your Bluetooth speaker be used purely at home? In that case you'll want something mains-powered. Do you want to be able to build a multi-room system around it? A smart Bluetooth speaker with with a built-in virtual assistant might be something to consider. If you want more flexibility from your Bluetooth speaker and the ability to chuck it in a bag and know that it'll function without issue later on, it sounds like a rugged, portable speaker with a built-in rechargeable battery could be your best shot at long-term compatibility and musical happiness.\n\nThe best Bluetooth speakers don't sacrifice on sound quality, either. Some offer impressive, room-filling, 360-degree sound while other models can be connected together and used as a stereo pair in a more traditional configuration. Whether you're on a tight budget or have money to burn, there's a model in this list that'll sort you out. You might even find yourself the proud owner of a What Hi-Fi? Awards winner...\n\n(Image credit: JBL)\n\n1. JBL Flip 5 Feature packed it isn't, but it sounds truly great for the money SPECIFICATIONS Dimensions: HxWxD (cm): 7.4 x 18.1 x 6.9 | Power: 20W | Features: Bluetooth v4.2, PartyBoost for multiple connections to PartBoost enabled JBL speakers, IPX7 rated | Connections: USB-C charger Reasons to Buy Solid bass and timing Great sense of acoustics PartyBoost stereo pairing Reasons to Avoid No aux-in or microphone Not Connect+ compatible Basic app\n\nIf all you want is a portable Bluetooth speaker that sounds as good as you can currently buy for around £100 ($100, AU$119), you’ll be hard-pressed to better the fantastic Flip 5. JBL’s newest offering sounds great for the price and is rugged enough to cope with a day at the pool.\n\nThe Flip 5 is waterproof to an IPX7 rating, boasts a 12 hour battery life and has a USB-C charging port, meaning it goes from flat to fully juiced in just 2.5 hours. It's a pleasure to use and scores highly for portability, with a wrist strap that slips comfortably over our hand. There's also a PartyBoost button that helps you pair two PartyBoost-enabled speakers to create a stereo pair, or link over 100 PartyBoost-compatible speakers in mono.\n\nSound is impressively weighty and agile, with a good punch of bass and a real sense of openness and texture. Assuming you don't mind the lack of an aux-in port or inbuilt microphone (as seen in the Flip 4), you'll almost certainly be wowed by this speaker's sonic chops. A superb performer.\n\nRead the full review: JBL Flip 5\n\n(Image credit: JBL)\n\n2. JBL Charge 4 A fun and bubbly Bluetooth speaker that's serious when it comes to sound SPECIFICATIONS Dimensions: HxWxD (cm): 22 x 9.5 x 9.3 | Power: 30W | Features: waterproof, Bluetooth v4.2, power bank, voice assistant integration | Connections: 3.5 mm stereo Reasons to Buy Rugged and water resistant USB port for charging Great sound quality Reasons to Avoid Perhaps too subtle for some\n\nThe fact that we really like the JBL Charge 4 should come as no surprise to those who read our Charge 3 review. Not only is this one of sweetest-sounding Bluetooth speakers around at this end of the market, it serves up a whopping 20 hours of playback from a single charge. Impressive.\n\nJBL has fine-tuned the sound in this latest iteration to please even pickier ears. Obviously there's a limit to the bass floor in a speaker of this size, but the low-end is tasteful – and there's plenty of punch.\n\nYou get a nice array of features for the money, too. The IPX7 water resistance means the Charge 4 can handle being submerged in water to a depth of 1.5m. And unlike the Flip 5 (above), you can also use the Charge 4 to juice up your phone – or any other device that will charge over USB from a 5V supply.\n\nThe Flip 5 (above) is cheaper and lighter, but the Charge 4's rugged design, excellent battery life and ‘battery sharing’ make it a near-perfect speaker for camping, beach trips and home use.\n\nRead the full review: JBL Charge 4\n\n(Image credit: Linn)\n\n3. Linn Series 3 The best-sounding wireless speaker we’ve heard SPECIFICATIONS Dimensions: HxWxD (cm):25 x 29.6 x 20.6 | Power: : 2x100W | Features: Wireless integrated Linn DSM player, Exakt digital crossover | Connections: Ethernet, USB, HDMI ARC Reasons to Buy Wonderfully articulate Luxury design HDMI ARC for TV connection Reasons to Avoid No analogue inputs No Tidal Masters support\n\nLet's address the elephant in the room: the Series 3 is one of the most expensive wireless speakers we have tested. It’s over three times the price of the B&W Formation Wedge. Can such an outlay be justified? Well, yes.\n\nLinn’s gorgeous design aesthetic and proprietary Exakt technology certainly helps. Linn Exakt aims to reduce phase errors by intentionally delaying higher frequencies so they arrive at your ear at the same time as lower frequencies. It also keeps the music signal’s data in the digital domain for as long as possible to avoid any degradation caused by signal processing. We’ve heard Exakt do its thing in many a Linn product before, and here again it contributes to an absorbing performance packed with stunning midrange clarity and a level of insight that sets it apart from more affordable competitors.\n\nAs you'd expect, the Series 3 is packed with premium features and Linn’s well established streaming platform, which offers access to networked servers and high-quality music services Tidal and Qobuz via Linn's app. You even get an HDMI ARC socket, which allows you to connect the speaker to a TV.\n\nAt £3000 ($3850, AU$5800), we can hardly describe the Series 3 as a bargain, but we are utterly convinced of its appeal.\n\nRead the full review: Linn Series 3\n\n4. Ultimate Ears Wonderboom 2 A fantastically affordable Bluetooth speaker with a weighty sound and good battery life. SPECIFICATIONS Connectivity: Bluetooth | Power: Battery | Battery life: 13hrs | Charge time: 2.6hrs **Dimensions (hwd):** 10.4 x 9.5 x 9.5cm | Weight: 420g Reasons to Buy Punchy, entertaining sound Hefty bass Decent battery life Reasons to Avoid No wi-fi or smart assistant built-in No mic for hands-free calls\n\nUltimate Ears has really made a splash in the Bluetooth speaker market with a number of colourful, fun-sounding and portable models. One its most biggest hits? The impressive Wonderboom 2.\n\nIt's waterproof, sandproof, dustproof and is also designed to float, so it should withstand the most lively of pool parties. Battery life is 13 hours and a full charge takes just under three.\n\nSonically, the Wonderboom 2 is an exciting listen. Bass is impressive bass given its small dimensions and there's plenty of detail and a fine sense of attack. You also get a ‘boost’ button on the underside of the unit. When pressed, it restricts the bass frequencies, allowing the UE to play louder through the midrange, which in turn makes the sound easier to hear when the unit is used outdoors.\n\nThere's no built-in mic or app, but the Wonderboom 2 is easily one of the best sounding Bluetooth speakers you can buy for the money – and a What Hi-Fi? 2019 Award-winner too, y'know.\n\nRead the full review: Ultimate Ears Wonderboom 2\n\n(Image credit: Dynaudio)\n\n5. Dynaudio Music 5 A superb sonic performance from a distinctive speaker SPECIFICATIONS Connectivity: Bluetooth and wi-fi | Power: 250W (mains powered) | Inputs: analogue audio jack, Toslink optical digital audio | Battery life: N/A | Dimensions (hwd): 20 x 66 x 18.5cm : | Weight: 5.4kg Reasons to Buy Expansive, weighty and accurate Great for larger rooms Top-notch build Reasons to Avoid No AirPlay 2 No Spotify Connect\n\nThe Dynaudio Music 5 is the second-largest one-box speaker in the company’s inaugural, four-strong Music series. And love or loathe its angular looks, we can’t help but be won over by how the Dynaudio Music 5 sounds.\n\nIt might be a powerful, but the Music 5 has the sonic nous to keeps things refined. While the Award-winning Naim (below) just edges it for both subtlety and a slightly livelier sound, there isn't much in it – and the Dynaudio Music 5 boasts superiority in other ways. In a larger room, it boasts better weight, scale and authority. Sound is smooth, detail-rich, refined and resoundingly listenable.\n\nConnectivity is excellent, too, with aptX Bluetooth, wi-fi and AirPlay all present. Open up the Dynaudio app and you'll discover NoiseAdapt, a feature that helps sound cut through a noisy room – useful during loud parties.\n\nAssuming you love its distinctive styling, the Dynaudio Music 5 is a sophisticated performer and a superb buy.\n\nRead the full review: Dynaudio Music 5\n\n6. Audio Pro Addon C3 Portability, multi-room skills and excellent sound quality in an impressive package. SPECIFICATIONS Connectivity: Bluetooth and wi-fi | Power: Battery | Inputs: 3.5mm | Battery life: 15hrs | Dimensions (hwd): 11.5 x 21.5 x 13.5cm | Weight: 2.45kg Reasons to Buy Mature, refined sound Impressive timing Tight, textured bass Reasons to Avoid Control app could be slicker\n\nThe Audio Pro Addon C3 isn't just the best Bluetooth speaker at this price, it's a stylish, wi-fi connected, multi-room capable centrepiece – and a What Hi-Fi? 2019 Award winner.\n\nSound is focused yet open and airy, meaning you can fill a decent sized room with immersive, weighty sound. It has an fantastic sense of refinement for such a small speaker, not to mention a rear-firing bass reflex port that delivers plenty of low-end grunt.\n\nThis model won't charge your smartphone but it does feature an ethernet port, giving you the option to hardwire it to your home network. The battery serves up around 15 hours playback (less if you crank the volume up to the max).\n\nThe C3 supports streaming services such as Spotify, Tidal, Qobuz and Apple Music, and while there's no built-in voice assistant, you can control the speaker via the Alexa app.\n\nIf you're after something more rugged and portable, we'd suggest rivals such as the Ultimate Ears Megaboom or JBL Xtreme. But as a sensational-sounding multi-room proposition, this speaker gives Sonos a serious run for its money.\n\nRead the full review: Audio Pro Addon C3\n\n(Image credit: Naim)\n\n7. Naim Mu-so Qb 2nd Generation Just a few tweaks make for a superb second version SPECIFICATIONS Dimensions: HxWxD (cm): 21 x 22 x 21 | Power: : 300W | Features: Apple AirPlay 2, Chromecast, Spotify Connect, Tidal, Roon Ready, Hi-res up to 24-bit/384kHz, remote control | Connections: 3.5mm aux, USB, optical S/PDIF, Ethernet Reasons to Buy Open, detailed and expressive Loads of streaming options Multi-room ready Reasons to Avoid Nothing at this price\n\nAt What Hi-Fi?, we know full well the value of revisions. Yet still, it was quite the surprise when first we heard about one made by Naim, with its second generation of the Mu-so Qb wireless speaker. The previous iteration was great, earning five stars when it was first reviewed. This version, however, is is truly phenomenal.\n\nYou can now choose between an Olive, Terracotta or Peacock grille alongside the standard black, but the best tweaks Naim has made go far deeper. Remove whatever colour grille you've gone for and you'll be rewarded with upgraded and optimised midrange and bass drive units, all powered by a total of 300W of amplification.\n\nYou won't be short of streaming options, thanks to Chromecast Built-in and Apple AirPlay 2 alongside Bluetooth for streaming from a device, as well as Spotify Connect, Roon Ready, internet radio and Tidal. You’ll also be able to access files up to 32-bit/384kHz anywhere on your home network via the updated Naim app\n\nWith punchy bass and sparkling and rich tones across the frequencies, we had no hesitation in awarding the Mu-so Qb 2nd Generation our 2019 What Hi-Fi? Award for the best home wireless speaker over £500.\n\nRead the full review: Naim Mu-so Qb 2nd Generation\n\n8. Amazon Echo Dot (3rd generation) One of the cheapest ways to introduce Alexa to your home. SPECIFICATIONS Dimensions: HxWxD (cm): 4.3 x 9.9 x 9.9 | Features: wi-fi, multi-room, Bluetooth V4.0, Alexa voice assistant, Spotify, TuneIn, Amazon Music | Connections: 3.5 mm stereo Reasons to Buy Clear, solid sound Improved Alexa capabilities Budget price Reasons to Avoid Alexa intelligence is limited\n\nAmazon's ever-expanding collection smart speakers dish up decent sound and a whole load of voice functionality for not a lot of money. The Echo Dot is one of the cheapest in the range – and a great little portable device that's perfect for the kitchen or bedroom.\n\nThe fabric-covered puck features a 4cm driver that pumps out decent enough sound. Alexa sounds loud and clear and, for the money, music sounds rich and full. It's perfectly acceptable as a background music device, plus you can always wire in other devices via the 3.5mm aux output for better sound.\n\nYou need to connect the Echo Dot to power, so it's not as portable as some options on this list. But on the upside, the Echo Dot can be used to play music, answer questions, read the news, check the weather, set alarms and control compatible smart home devices, from TVs to home cinema amplifiers and speakers.\n\nFor the money, it's one of the best cheap portable speakers around.\n\nRead the full review: Amazon Echo Dot (3rd generation)\n\n9. Audio Pro Addon T3 It may not be as portable as some, but the Addon T3's extra size works in its sonic favour. SPECIFICATIONS Dimensions: HxWxD (cm): 11.5 x 21.5 x 13.5 | Power: 2x 5W + 15W Digital class D | Features: Bluetooth V4.0 | Connections: 3.5mm stereo, USB Reasons to Buy Full sound Expressive and dynamic Faultless build Reasons to Avoid Size won't suit everyone\n\nIt might be one of the less portable speakers in this list, but the T3 can still be carted around thanks to the carry handle. It's robust rather than heavy, and boasts a battery life of up to 30 hours. Like bass? You're in luck - the solid chassis and rear-firing bass port will have you tapping your toe in no time.\n\nThere's no wi-fi (if you want wi-fi, opt of the Addon C3), but the Bluetooth-enabled T3 features a similarly classy design with textured surfaces and a leather embossed handle .\n\nAudio Pro tends to ignore gimmicks in favour of high-quality sound but this speaker does have the facility to charge up your smartphone or tablets via a USB port. You also get an auxiliary input for your TV/MP3 player/record player.\n\nSound is superb, with plenty of depth and detail throughout the frequencies. If you want something for home and in the garden, this could work nicely – maybe not the one for your carry-on luggage, though.\n\nRead the full review: Audio Pro Addon T3\n\n10. JBL Xtreme 2 One of the best Bluetooth speakers around for the money. SPECIFICATIONS Connectivity: Bluetooth | Power: Battery | Inputs: 3.5mm | Battery life: 15hrs | Dimensions (hwd): 13.6 x 28.8 x 13.2cm | Weight: 2.39kg Reasons to Buy Clean, clear sound Balanced bass Robust build Reasons to Avoid Hefty design No wi-fi or multi-room smarts\n\nThe JBL Xtreme 2's boombox design has fun and excitement written all over it. The rugged, IPX7 waterproof exterior, 15 hour battery life and ability to charge your phone from its USB port mean it's a great option for the beach.\n\nWireless features have been stripped-back, though. There's no wi-fi, so you can't stream from Spotify. And it won’t let you talk to Alexa or Google Assistant, just set a button to activate them in the manner of an earphone’s in-line remote.\n\nJBL Connect+ is the most unusual feature on this otherwise standard Bluetooth speaker. It lets you link up to 100 JBL speakers, to make the equivalent of a nightclub PA in your home.\n\nThere's plenty of boom to the sound, but we're not talking ridiculous levels. That deep powerful bass is also nicely controlled too. Mids are of a high quality and highs show more clarity than you traditionally get from such a product. For the money, the JBL Xtreme 2 is brilliantly balanced Bluetooth speaker.\n\nRead the full review: JBL Xtreme 2\n\n11. Ultimate Ears Blast Energetic performance, Alexa onboard and Wi-Fi connectivity. SPECIFICATIONS Connectivity: Bluetooth and wi-fi | Power: Battery | Inputs: N/A | Battery life: 12hrs | Dimensions (hwd): 118.8 x 6.8 x 6.8cm | Weight: 463g Reasons to Buy Great portable design Exciting, dynamic sound Good detail and punchy timing Reasons to Avoid Top end can get excitable at loud volumes Alexa features not exhaustive\n\nUltimate Ears has a knack for making Bluetooth speakers that combine the right combination of sound, design and rugged features, and it does so again with the Blast. Its cylindrical 360-degree design means it throws sound evenly around the room, while the tough 'IP67 waterproof' exterior means it can can survive in 1m of water for 30 minutes.\n\nIt's crammed with connectivity, too. You get Bluetooth, wi-fi and Alexa smart assistant voice controls, meaning you can turn up the volume or play songs through Amazon Music Unlimited without lifting a finger. Far-field voice recognition is excellent, and there's a nifty LED strip that glows and blinks when you interact with Alexa.\n\nThe lack of 3.5mm audio input might bother some, but we found the Blast to be a real crowd-pleaser. The 360-degree sound and bass output is far better than one might expect for this kind of money; throw in Alexa smarts and you have a fun, energetic speaker that offers plenty of bang for your buck.\n\nRead the full review: UE Blast\n\n(Image credit: Amazon)\n\n12. Amazon Echo Show 5 SPECIFICATIONS Dimensions (hwd): 8.6 x 14.8 x 7.3cm | Connectivity: Wi-fi, USB, 3.5mm line-in | Battery life: n/a | Power: 4W Reasons to Buy Alexa voice-control Decent sound and video Nicely put together Reasons to Avoid Audio isn't the best\n\nThe Echo Show 5 is the latest in a long and fast-moving line of Amazon products intended to get us all invested in its virtual assistant, Alexa. Where much of the Alexa-enabled kit out there is audio based, concentrated on the Bluetooth speaker market in particular, the Echo Show 5 embraces both sound and video in its abilities to communicate. So, as well as playing music or reading out information, you can access video content on the 5.5in LCD touchscreen. There's also a camera for video calls.\n\nThe Echo Show 5 is a diminutive device, and as such cannot possibly offer the scale of sound that some specialist wireless speakers can. But then it offers so much more ability and functionality than a run-of-the-mill Bluetooth speaker. For what it is, we find the sound perfectly acceptable. It runs fairly warm, sonically, which helps voices on radio and the like, and makes for a comfortable listening experience. There are better speakers out there but this is much more than that. It opens up the world of the digital assistant to a whole new audience for both audio and video; and if that’s what you’re after, this is about as good as you’ll get.\n\nRead the full review: Amazon Echo Show 5\n\n13. Dali Katch With its smooth, engaging sound and 24-hour battery life, this Dali Bluetooth speaker ticks all our boxes. SPECIFICATIONS Dimensions (hwd): 13.8 x 26.9 x 4.7cm | Connectivity: aptX Bluetooth, 3.5mm | Battery life: 24hr | Power: 50W Reasons to Buy Powerful, full-bodied sound Great dynamics and timing Long battery life Reasons to Avoid Nothing at this price\n\nIf you're after a premium portable speaker, there's every chance that the Dali Katch will blow your cashmere socks off. Dali, better known for its traditional hi-fi speakers, has managed to extract a sound that is quite simply incredible for something of the Katch’s stature.\n\nTwo tweeters and a pair of aluminium woofers, driven by a Class-D amplifier, make for a total power output of 50W – not to mention an impressive amount of detail and a nice dose of velvety low-end.\n\nThe speaker boasts buttons for power, volume and pairing, which is made easier with the option of NFC. There are also two EQ presets: one for freestanding play and one for positioning on a shelf. And let's not forget the excellent battery life: just two hours of charge will get you around 24 hours of music playback via Bluetooth.\n\nThe Katch isn't cheap, but you do get what you pay for – a weighty, dynamic sound that defies this speaker's dimensions.\n\nRead the full review: Dali Katch\n\n14. Ultimate Ears Megablast A lively, entertaining speaker that manages to control its performance at the same time as really letting its hair down. SPECIFICATIONS Connectivity: Bluetooth and wi-fi | Power: Battery | Inputs: N/A | Battery life: 16hrs | Dimensions (hwd): 23.7 x 8.8 x 8.8cm | Weight: 1.19kg Reasons to Buy Dynamic, detailed sound Enthusiastic, punchy rhythms Precise, taut basslines Reasons to Avoid Presentation is slightly lean Not fully featured just yet\n\nThe powerful UE Megablast takes the performance of a portable Bluetooth speaker at this price to a new level. If you're looking for thumping bass, well, let's just say you've come to the right place.\n\nDesign-wise, the Megablast is waterproof (IP67 rated), so it will survive being dunked in the pool or exposed to a sudden downpour. Battery life is 16 hours, which is pretty respectable given that it has Alexa voice smarts built-in.\n\nSay the wake word ‘Alexa’ and a white LED strip on top of the Megablast glows in recognition. Features include voice-controlled music playback over wi-fi, through Amazon Music Unlimited and TuneIn radio, plus support for the likes of Spotify, Deezer and Amazon Music. There's no 3.5mm audio jack, though.\n\nA combination of pounding bass and enthusiastic sense of rhythm make for a hugely enjoyable performance. It might not be the most pocketable speaker around, but few rivals can match the Megablast for bass quality. An absolute treat.\n\nRead the full review: UE Megablast\n\n15. JBL Go 2 Impressive sound from an impressively small package. SPECIFICATIONS Dimensions: HxWxD (cm): 7.1 x 8.6 x 3.2 | Power: 3W | Features: IPX7 waterproof, Bluetooth V4.1 | Connections: micro-USB | Finishes: 12 Reasons to Buy Tidy design Balanced sound Decent bass Reasons to Avoid Battery life could be better\n\nThe budget JBL Go 2 might be the perfect holiday accessory. It's a tiny speaker, no bigger than a bar of soap, which makes it small enough to slip into your pocket. There are 12 colours in the range, including the retro-fabulously pearlescent yellow model pictured above.\n\nThe Go 2 has a full waterproof IPX7 rating, so it won't matter if you drop it in the pool by mistake. Features are thin on the ground, but you go get an aux input, plus a noise-cancelling speakerphone and built-in mic for handsfree calls. There's no wi-fi, though, and the battery life is a little disappointing: 2.5 hours of charging returns a maximum playing time of just five hours.\n\nDespite an output of just 3W, the Go 2 punches above its weight when it comes to sound. For the money, it's a lively, balanced and cohesive performer. If you're the sort of person who likes to travel light, we'd highly recommend packing one of these nifty pocket speakers.\n\nRead the full review: JBL Go 2\n\n16. Bose SoundLink Mini II This Bose portable speaker is a decent option for the money. SPECIFICATIONS Dimensions: HxWxD (cm): 5.1 x 18 x 5.8 | Features: Bluetooth V3.0 | Connections: 3.5mm stereo, micro-USB Reasons to Buy Full-bodied sound Weighty bass Portable Reasons to Avoid Lows lack precision and agility\n\nIf you’re after a portable speaker that doesn't scrimp on bass weight, the SoundLink Mini II could be just the ticket. The small but hefty design pumps out a big, bassy sound that will get you dancing by the pool.\n\nBose has kept features to a bare minimum; there are buttons for power, pairing (you can link two devices at a time and switch between them) and volume. You also get an aux input and a USB input for charging. Battery life is 10 hours – pretty good for a speaker of this size.\n\nThe big attraction here is the sound quality. While lots of portable speakers offer fuller bass, it's often boomy or distorted. That's certainly not the case with the SoundLink Mini II, which sounds taut and expressive. Vocals are exceedingly rich and instruments are given space to breathe. In fact, the sound is as good as anything we've heard at this price and stature. Other speakers are better value for money, but this high-quality Bose speaker is still a fantastic buy.\n\nRead the full review: Bose SoundLink Mini II", "publish_date": "2020-06-19", "keywords": ["x", "bluetooth", "budget", "music", "speaker", "life", "best", "bass", "reasons", "speakers", "2020", "sound", "battery", "portable"], "authors": ["Becky Scarrott"], "summary": "Best Bluetooth speakers Buying Guide: Welcome to What Hi-Fi?\nFret not, we've rounded-up our pick of the best portable Bluetooth speakers across all shapes, sizes and prices to ensure you discover a product you'll be over the moon with.\nThe key thing here is to avoid opting for the first Bluetooth speaker that takes your fancy.\nThere's no built-in mic or app, but the Wonderboom 2 is easily one of the best sounding Bluetooth speakers you can buy for the money – and a What Hi-Fi?\nJBL Xtreme 2 One of the best Bluetooth speakers around for the money."}