{"link": "https://www.soundguys.com/best-bluetooth-speakers-2488/", "title": "Best Bluetooth speakers of 2020", "text": "Finding an audiophile who doesn’t like Bluetooth headphones is easy, just ask our own Chris Thomas, but Bluetooth speakers are awesome. The convenience of being able to take the party wherever you go is invaluable and any of the best Bluetooth speakers can make your backyard barbecue an absolute hit. Whether you’re looking for something tough and durable that you can beat up and throw around or something that will just sound great, you can’t go wrong with anything on this list.\n\nEditor’s note: this list of the best Bluetooth speakers was updated on June 17, 2020 to replace the Anker Soundcore Flare with the Flare 2, and to add the Flare+ and Flare Mini to the notables section.\n\nIf you want the best, go with the JBL Charge 4\n\nWhether you’re having a pool party or going camping, the best all-around speaker you want by your side is the JBL Charge 4. Initially, we had the JBL Charge 3 in this top spot, even after the newer model was released. The reason for this was because the upgrades between the Charge 3 and the newer Charge 4 are minimal, and the cost difference just wasn’t justifiable. That said, it’s now been a while since the release of the Charge 4 and its dropped in price to roughly the same as the older Charge 3. In that case, why spend the same money for an older product?\n\nJBL Charge 4 Full Review\n\nBest All-Around\n\n\n\n\n\n\n\nJBL Charge 4 8.7\n\nOf course, some of the best features of the Charge 4 aren’t exclusive to it. Both the JBL Xtreme and JBL Flip 4 also share these features, but the Charge 4 hits the sweet spot. You get some of that large sound that the Xtreme offers with some of the portability of the Flip 4. It makes all the right compromises, including battery life. You’ll get about 20 hours as well as the option to charge some of your other devices, thanks to a USB-A output (hence the name). As far as sound quality goes, the only area that isn’t great is the mids, these tend to take a backseat to the bass in small to medium-sized rooms.\n\nHowever, a word of caution: the JBL Flip 5 does not support the multi-speaker linking standard of the older JBL speakers, and it only has one channel. We recommend sticking with the Flip 3 or Flip 4 instead—they get the job done and you’ll spend less money to get them.\n\nWhat you should know\n\nPay attention to Bluetooth codecs\n\nJust like wireless headphones, Bluetooth speakers support specific Bluetooth codecs. For those unfamiliar with the concept, a codec determines how a file is transmitted from a source (phone) to a receiver (speaker). If you want a lag-free experience make sure to invest in something that supports aptX, or AAC if you’re an iOS user. Not only does this reduce latency, but it also allows for better streaming quality (at least if you use AAC with iOS).\n\nBluetooth isn’t all it’s cracked up to be. While we do like Bluetooth for its convenience, it’s not as good as wired when it comes to sound quality. We probably didn’t have to tell you that, but at least we can show you.\n\nPool party people should pay attention to IP ratings\n\nSometimes a product’s specifications will plainly read, “sweat-resistant,” or something similar. However, if you know you’re going to take your speaker on a boat or to the beach, you should invest in something with an official IP rating. IP ratings denote the dust and water resistance of a particular product. Oftentimes, a product will be rated something like “IPX4” and the “X” is just a placeholder for what would be a dust-resistance rating. For a product to withstand full submersion, it must be at least IPX7 or higher.\n\nThe Marshall Stanmore has the best audio quality\n\nWireless speakers are great for portability, but if you really want to power a party you might need to plug the speaker into a wall outlet. This is the case with the Marshall Stanmore, which takes the crown for the best sounding speaker on this list. It’s large, so it’s very rarely going to leave the house. But if you’re looking to have a party or just want to fill your room with the sound of music, this is one of the best Bluetooth speakers out there. Partly because (and this might be cheating a bit) along with Bluetooth 4.2, you can connect to it via your WiFi network thanks to Spotify Connect, Chromecast built-in, and Apple AirPlay compatibility.\n\nMarshall Stanmore Multi-room Full Review\n\nBest Sound\n\n\n\n\n\nMarshall Stanmore Multi-room 8.8\n\nThe speaker sticks to the tried-and-true, classic amp design Marshall is known for, complete with knobs up top to let you control basic EQ. There’s also a dedicated knob for seven easy presets, be it your favorite Spotify playlist, radio station, or podcast. What you’re sacrificing in terms of portability, you’re making up for when it comes to sound. And, man, this speaker sounds great. It places a slight emphasis on mids (which means vocals are a bit easier to hear), but you can always tweak the sound to your preference by using the knobs up top. If you decide to get more than one, you can also pair them up for multi-room audio; though, if you’re not using one of the WiFi options, you’ll just have to stick to Bluetooth.\n\nRelated: Best Google Assistant smart speakers\n\nWhat are some alternatives?\n\nSony XB41 Full Review\n\nBest Design\n\n\n\n\n\nSony XB41 7.8\n\nWhen we put the SRS-XB40 and the SRS-XB41 (two of Sony’s latest speakers) head-to-head, the older SRS-XB40 actually came out on top. But in the case of which one looks better, it’s a no-brainer. The SRS-XB41 wins by a long shot here.\n\nThough it’s a little more expensive you get a few nice hardware upgrades, that might be worth the extra cash for some people. For one, the speaker comes wrapped in a nice fabric that makes it easy to hold, despite its large size. But it’s not just for looks. That fabric also gives the speaker its IP67 rating. This means that whether you want to take it to the beach or chill poolside, you won’t have to worry about sand or water damaging it. You can even submerge it in up to a meter of water for 30 minutes. Though, we obviously wouldn’t recommend doing that.\n\nDurability aside, the SRS-XB41 is one of the slicker Bluetooth speakers out there. It has LED lights around all the edges making it just as pretty to look at as it sounds. Because, yes, the XB41 sounds really good. It doesn’t have quite the same amount of clarity in the lower notes as the previous XB40 has, but it’s no slouch. If you want something that gets loud, can go with you anywhere, has crazy good battery life, and will turn heads, then this might be for you. Just be prepared to pay a pretty penny for it.\n\nFor the ultimate party speaker, get the UE Hyperboom\n\nUltimate Ears has been in the Bluetooth speaker market for years now, and the one thing its product line-up was missing was a giant speaker that could power your parties. That ends with the UE Hyperboom, which is the new giant speaker from the company. This speaker has an IPX4 splashproof build along with a battery life that should last you about 24 hours of constant playback.\n\nUE Hyperboom Full Review\n\nBest for parties\n\n\n\n\n\n\n\nUE Hyperboom 7.4\n\nThere are also a number of unique features that make this perfect for parties. For one, it has two Bluetooth inputs so a second person can connect to the speaker and line up the next track without disrupting the music coming from a first device. It’s a simple problem to a common problem at parties. There’s also an optical input so when you’re not using this as your party speaker you can plug it into your TV for instantly better sound. While it’s not going to give you soundbar level of quality, it’s sure to be an upgrade for most people. Of course, it isn’t cheap and not very portable but if you’re after a loud speaker that sounds good and has some great features this is the way to go.\n\nFor the best budget option, check out the Anker Soundcore Flare 2\n\nThe Anker Soundcore Flare 2 builds off the success of the original Flare speaker, offering room-filling sound at a price that won’t break the bank.\n\nAnker Soundcore Flare 2\n\nBang for your Buck Anker Soundcore Flare 2 9.4\n\nThe Flare 2 sports powerful dual drivers and passive radiators, outputting 20W of sound with improved clarity and bass response compared to its predecessor. With an upgraded IPX7 waterproof rating, coupled with a Dual LED Halo on the top and bottom, your speaker can set the tone for your party, wherever you may be. EQ and lighting controls are available through the Soundcore app, where you can also connect up to 100 Flare 2’s to fill every crevice of your room with booming sound.\n\nThe speaker boasts a 5,200 mAh battery with 12 hours of continuous playback, and can be charged through its USB-C port. The only real drawback is that it lacks a 3.5mm input jack. Still, at less than $100, it’s hard to find another similarly-priced Bluetooth speaker that could compete with the Flare 2.\n\nBest Bluetooth speakers: notable mentions\n\nAnker Soundcore Flare+: If you’re willing to fork up a little more cash, you get a more powerful speaker with significantly increased bass reproduction, compared to the Flare 2.\n\nAnker Soundcore Flare Mini: If you want to save a little cash money, the Flare Mini is the little sibling of the Flare lineup: similar build quality, smaller form factor and less powerful drivers.\n\nJBL Charge 3: While it’s missing the USB-C charging and is basically the same price as the newer Charge 4, the Charge 3 is still a solid option.\n\nJBL Clip 3: The newest Clip 3 is one of the better deals in all of Bluetooth speakers, giving you a pint-sized durable speaker with a great battery life and the option to clip/hang it anywhere thanks to a built-in carabiner.\n\nJBL Flip 5: If you’re looking for a Bluetooth speaker that won’t cost you more than $100 then the Flip series has always been a go-to. Now, there’s the JBL Flip 5 which offers everything that the Flip 4 did, but with bigger drivers and USB-C charging.\n\nJBL Link 300: If you want a smart speaker with integrated Google Assistant, the JBL Link 300 is a reasonably priced option.\n\nMonster Solara : If you can overlook its unapologetic plastic build and large size, you’ll get a unique speaker that’s sure to be a head turner.\n\nSony SRS-XB32: While it suffers from many of the same flaws as its older sibling on this list, the SRS-XB32 also excels in exactly the same ways. It’s a fun, tough little speaker perfect for the beach or backyard get-togethers.\n\nSony SRS-XB40 : At $79 the XB40 is hard to pass on even if it isn’t the newest speaker. Though it’s not as pretty, it’s definitely a better value than the newer SRS-XB41 if you don’t need full waterproofing.\n\nUE Wonderboom 2: The second-generation Wonderboom is one of our favorite speakers because it’s waterproof build, small size, and the ability to float. If you want to save a few bucks, the original Wonderboom works just as well.\n\nV-Moda Remix: The Remix Bluetooth speaker from V-Moda is impressive for its size, comes with some pretty cool features like a built-in headphone amp, and sounds good. But it’s also pricey, which is the main reason it didn’t make our list.\n\nHow we chose the best Bluetooth speakers\n\nThere are thousands and thousands of Bluetooth speakers in the world and it’d be impossible for us to review them all, but that doesn’t stop us from trying to get our grubby hands on all of them. If a speaker made it onto this list, then you can be sure we’ve had first-hand experience with them and in many cases put them through our entire review process.\n\nNot only do we directly review and test as many audio products as we can, but we also take into account what others are saying about a given product. We want our readers to be happy with their purchases and that means we had to narrow down what it means to be “the best Bluetooth speaker.” In this case, we needed it to sound good, be relatively affordable, and durable. If a speaker’s intended use is for camping or hiking, we made sure that it’s received an official IP rating. Generally, if Bluetooth speakers perform well, there’s no need to overspend for the sake of overspending.\n\nWhy you should trust SoundGuys\n\nWorking this site is each of our day jobs and we’re committed to streamlining the research and purchasing process for our readers. At the end of the day, we realize that you can spend an exorbitant amount of money to get the absolute best product of X-category, but we respect that many consumers don’t fall into that category. Ultimately, we want you to love what you purchase and none of us may benefit from steering you toward or away from a certain product.\n\nWhat’s more, we regularly update this lists and are receptive to comments, so if your favorite Bluetooth speaker didn’t make it, let us know and let us know why it’s your favorite. At the end of the day, we work with audio products because we love them, and if you feel so compelled, we suggest you take a moment to read our ethics policy.\n\nNext: Best Bluetooth speakers under $100\n\nStill looking? Check out these other best lists.", "publish_date": "2020-06-17", "keywords": ["youre", "jbl", "bluetooth", "flip", "speaker", "best", "speakers", "2020", "sound", "charge", "flare"], "authors": ["Adam Molina", "Why Settle For Less When You Can Get The Best"], "summary": "Finding an audiophile who doesn’t like Bluetooth headphones is easy, just ask our own Chris Thomas, but Bluetooth speakers are awesome.\nThe convenience of being able to take the party wherever you go is invaluable and any of the best Bluetooth speakers can make your backyard barbecue an absolute hit.\nEditor’s note: this list of the best Bluetooth speakers was updated on June 17, 2020 to replace the Anker Soundcore Flare with the Flare 2, and to add the Flare+ and Flare Mini to the notables section.\nWhat you should knowPay attention to Bluetooth codecsJust like wireless headphones, Bluetooth speakers support specific Bluetooth codecs.\nNext: Best Bluetooth speakers under $100Still looking?"}