{"title": "UniversityofTexas-AustinPromisesFreeTuitionForLow-IncomeStudentsIn2020", "text": "University of Texas-Austin Promises Free Tuition For Low-Income Students In 2020\n\ntoggle caption Jon Herskovitz/Reuters\n\nFour year colleges and universities have difficulty recruiting talented students from the lower end of the economic spectrum who can't afford to attend such institutions without taking on massive debt. To remedy that — at least in part — the University of Texas-Austin announced it is offering full tuition scholarships to in-state undergraduates whose families make $65,000 or less per year.\n\nThe University of Texas System Board of Regents voted unanimously on Tuesday to establish a $160 million endowment, drawing from the state's Permanent University Fund to begin the program in the fall of 2020.\n\n\"Recognizing both the need for improved access to higher education and the high value of a UT Austin degree, we are dedicating a distribution from the Permanent University Fund to establish an endowment that will directly benefit students and make their degrees more affordable,\" Chairman of the Board of Regents Kevin Eltife said after the vote.\n\n\"This will benefit students of our great state for years to come,\" he added.\n\nThe endowment — which includes money from oil and gas royalties earned on state-owned land in West Texas — more than doubles an existing program offering free tuition to students whose families make less than $30,000. It also expands financial assistance to middle class students whose families earn up to $125,000 a year, compared to the current $100,000.\n\nUT-Austin is among the Texas system's more affordable universities; tuition and fees cost about $10,500. The endowment will foot the bill for those charges but not additional living expenses, including room and board, which can add another $17,000 in annual fees.\n\nOfficials expect about 8,600 students — nearly a quarter of undergraduates, including those already enrolled — will benefit from the full tuition program and another 5,700 will gain access to additional financial support, the release said. Transfer students will also be eligible, but graduate students will not.\n\n\"There is no greater engine of social and economic mobility than a college degree, and this initiative ensures that more Texans will benefit from a high-quality UT Austin education,\" University Chancellor James Milliken said in a statement.\n\nCindy Muñoz, an incoming freshman from Houston, was on campus Wednesday for orientation. She was thrilled to learn of the endowment. Her mother is a single parent who has been working as a housekeeper and doing other odd jobs to make ends meet.\n\nUntil Tuesday Muñoz planned to pay for most of her college with loans. \"I knew I was going to go into student debt,\" she said, adding that she was willing to take on the loans to go to her dream school.\n\n\"I had that already in my head because my sister went to college and she had to take out loans, and she's still dealing with loans today and she's 38 years old,\" Muñoz said.\n\nOnce it goes into effect, the new financial aid program will apply to Muñoz and cover all of her tuition. She said she'll only need loans to pay for some of her living expenses.\n\n\"It kind of makes me feel like I chose the right school,\" Munoz said. \"Because a school that is willing to see past your socio-economic status, look at you as a student, a person who just wants to advance their education and pursue a career, I think they look past monetary issues and they're like, 'You want to do this? Then we're going to help you out.' \"\n\nThe school noted it landed on the $65,000 cap because the average median household income in Texas in 2017 was $59,206.\n\nAs tuition rates continue to climb and financial aid has continued to lag behind, a growing number of public and private four-year institutions are offering free tuition to students below a certain income.\n\nIn 2008, Texas A&M began offering free tuition to students whose families' income was under $60,000. Michigan established the Kalamazoo Promise, which covers four years of tuition at any public college in the state as well as 15 private colleges. Louisiana offers a more restrictive program that comes with certain caveats, including a minimum aptitude test score.\n\nLast year, New York launched The Excelsior Scholarship, allowing middle-class families and individuals making up to $125,000 a year to qualify for tuition-free enrollment at all CUNY and SUNY two and four-year colleges.\n\nBut some states are finding it difficult to sustain such programs. Oregon launched the Oregon Promise in 2016 but the program there had to be scaled back after a budget shortage, Pew reported.\n\nEditor's note: NPR member station KUT's broadcast license is owned by the University of Texas. Its newsroom operates independently.", "publish_date": "2019-07-10", "keywords": ["university", "promises", "offering", "students", "texasaustin", "endowment", "program", "lowincome", "free", "tuition", "2020", "muñoz", "families", "texas", "loans"], "authors": ["Vanessa Romo", "Claire Mcinerny"], "summary": "University of Texas-Austin Promises Free Tuition For Low-Income Students In 2020toggle caption Jon Herskovitz/ReutersFour year colleges and universities have difficulty recruiting talented students from the lower end of the economic spectrum who can't afford to attend such institutions without taking on massive debt.\nTo remedy that — at least in part — the University of Texas-Austin announced it is offering full tuition scholarships to in-state undergraduates whose families make $65,000 or less per year.\nThe endowment — which includes money from oil and gas royalties earned on state-owned land in West Texas — more than doubles an existing program offering free tuition to students whose families make less than $30,000.\nIt also expands financial assistance to middle class students whose families earn up to $125,000 a year, compared to the current $100,000.\nIn 2008, Texas A&M began offering free tuition to students whose families' income was under $60,000."}